#-----------------------------------------
# Taps
#-----------------------------------------
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/cask-drivers'
tap 'homebrew/services'
# tap 'int128/kubelogin'

#-----------------------------------------
# Brew CLI apps
#-----------------------------------------
brew 'mas'
brew 'vim'
brew 'wget'

#-----------------------------------------
# Dev
#-----------------------------------------
# general
brew 'git'
# brew 'yarn'

# terminal
brew 'zsh'
brew 'fzf'
brew 'neovim'
brew 'zellij'

# containers
cask 'docker'
# brew 'kubernetes-cli' # kubectl
# brew 'kubectx'
# brew 'int128/kubelogin/kubelogin'
# brew 'helm'

# python
# brew 'poetry'
# brew 'pyenv'
# brew 'pyenv-virtualenv'

#-----------------------------------------
# App casks
#-----------------------------------------
cask '1password'
cask 'arc'
# cask 'google-chrome'
# cask 'iterm2'
cask 'karabiner-elements'
cask 'notion'
cask 'notion-calendar'
cask 'postman'
# cask 'pycharm-ce'
cask 'rectangle'
cask 'slack'
cask 'tableplus'
cask 'visual-studio-code'
# cask 'webstorm'
cask 'zoom'

cask 'font-monaspace'
#-----------------------------------------
# Mac App Store apps
#-----------------------------------------
