#-----------------------------------------
# Taps
#-----------------------------------------
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/cask-drivers'
tap 'homebrew/services'
tap 'int128/kubelogin'

#-----------------------------------------
# Brew CLI apps
#-----------------------------------------
brew 'mas'
brew 'vim'
brew 'wget'

#-----------------------------------------
# Dev
#-----------------------------------------
# general
brew 'git'
brew 'yarn'

# terminal
brew 'zsh'
brew 'fzf'

# containers
cask 'docker'
brew 'kubernetes-cli' # kubectl
brew 'kubectx'
brew 'int128/kubelogin/kubelogin'
brew 'helm'

# python
brew 'pyenv'

#-----------------------------------------
# App casks
#-----------------------------------------
cask '1password'
cask 'google-chrome'
cask 'iterm2'
cask 'notion'
cask 'pycharm-ce'
cask 'rectangle'
cask 'slack'
cask 'tableplus'
cask 'tunnelblick'
cask 'visual-studio-code'
cask 'webstorm'
cask 'zoom'

#-----------------------------------------
# Mac App Store apps
#-----------------------------------------
